/* Task 2

Написать функцию, которая принимает на входе любое 
число (но не больше 1 000), определяет, является 
ли оно простым, и выводит простое число или нет. 
Если введено больше 1 000, то выводится сообщение, 
что данные неверны. Обратите внимание на числа 0 и 1.

Здесь вам пригодятся знания из предыдущего 
модуля — циклы и условные операторы. */

let userNamber = 787; // Число от 0 до 1000

// Решение на основании готового масива простых чисел

function primeNumber1(userNamber) {
  let arrayPrimeNambres = [
    2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71,
    73, 79, 83, 89, 97, 101, 103, 107, 109, 113, 127, 131, 137, 139, 149, 151,
    157, 163, 167, 173, 179, 181, 191, 193, 197, 199, 211, 223, 227, 229, 233,
    239, 241, 251, 257, 263, 269, 271, 277, 281, 283, 293, 307, 311, 313, 317,
    331, 337, 347, 349, 353, 359, 367, 373, 379, 383, 389, 397, 401, 409, 419,
    421, 431, 433, 439, 443, 449, 457, 461, 463, 467, 479, 487, 491, 499, 503,
    509, 521, 523, 541, 547, 557, 563, 569, 571, 577, 587, 593, 599, 601, 607,
    613, 617, 619, 631, 641, 643, 647, 653, 659, 661, 673, 677, 683, 691, 701,
    709, 719, 727, 733, 739, 743, 751, 757, 761, 769, 773, 787, 797, 809, 811,
    821, 823, 827, 829, 839, 853, 857, 859, 863, 877, 881, 883, 887, 907, 911,
    919, 929, 937, 941, 947, 953, 967, 971, 977, 983, 991, 997,
  ];
  let result = false;
  if (userNamber >= 0 && userNamber <= 1000) {
    for (let i = 0; i < arrayPrimeNambres.length; i++) {
      result ||= userNamber === arrayPrimeNambres[i] ? true : false;
    }
    if (result) {
      return "Простое";
    } else {
      return "Не простое";
    }
  } else {
    return "Вы ошиблись";
  }
}

// Решение на основании вычисления признака простого числа

function primeNumber2(userNamber) {
  if (userNamber < 0 || userNamber > 1000) {
    return "Вы ошиблись";
  }
  if (userNamber === 0 || userNamber === 1) {
    return "Не простое";
  }
  let result = true;
  for (let i = 2; i < 101; i++) {
    if (userNamber !== i) {
      result &&= userNamber % i !== 0 ? true : false;
    }
  }
  if (result) {
    return "Простое";
  } else {
    return "Не простое";
  }
}

console.log(
  `Поиск в массиве простых чисел: ${userNamber} - ${primeNumber1(userNamber)}`
);
console.log(
  `Вычисление признака простого числа: ${userNamber} - ${primeNumber1(
    userNamber
  )}`
);
